
TYPES = [
    "說明或博覽會",
    "面試或徵人",
    "醫學年會",
    "國際會議",
    "其他(請於備註說明)",
]

DEPARTS = [
    "PGY",
    "R",
    "VS",
    "家庭醫學科",
    "內科",
    "外科",
    "兒科",
    "婦產科",
    "骨科",
    "神經外科",
    "泌尿科",
    "耳鼻喉科",
    "眼科",
    "皮膚科",
    "神經科",
    "精神科",
    "復健科",
    "麻醉科",
    "放射診斷科",
    "放射腫瘤科",
    "解剖病理科",
    "臨床病理科",
    "核子醫學科",
    "急診醫學科",
    "職業醫學科",
    "整形外科",
    "其他醫療院所(請於備註說明)"
]

N_HOSPITALS = {
    "長庚醫療財團法人基隆長庚紀念醫院",
    "國立台灣大學醫學院附設醫院",
    "臺北榮民總醫院",
    "三軍總醫院附設民眾診療服務處",
    "台灣基督長老教會馬偕醫療財團法人馬偕紀念醫院",
    "國泰醫療財團法人國泰綜合醫院",
    "新光醫療財團法人新光吳火獅紀念醫院",
    "臺北市立萬芳醫院-委託財團法人臺北醫學大學辦理",
    "臺北市立聯合醫院仁愛院區",
    "臺北醫學大學附設醫院",
    "振興醫療財團法人振興醫院",
    "醫療財團法人辜公亮基金會和信治癌中心醫院(試辦計畫)",
    "醫療財團法人徐元智先生醫藥基金會亞東紀念醫院",
    "佛教慈濟醫療財團法人台北慈濟醫院",
    "天主教耕莘醫療財團法人耕莘醫院",
    "衛生福利部雙和醫院(委託臺北醫學大學興建經營)",
    "輔仁大學學校財團法人輔仁大學附設醫院",
    "長庚醫療財團法人林口長庚紀念醫院",
    "衛生福利部桃園醫院",
    "台灣基督長老教會馬偕醫療財團法人新竹馬偕紀念醫院",
    "國立臺灣大學醫學院附設醫院新竹臺大分院新竹醫院",
}

W_HOSPITALS = {
    "臺中榮民總醫院",
    "中國醫藥大學附設醫院",
    "中山醫學大學附設醫院",
    "童綜合醫療社團法人童綜合醫院",
    "光田醫療社團法人光田綜合醫院",
    "澄清綜合醫院中港分院",
    "彰化基督教醫療財團法人彰化基督教醫院",
    "秀傳醫療社團法人秀傳紀念醫院",
    "國立臺灣大學醫學院附設醫院雲林分院"
}

S_HOSPITALS = {
    "戴德森醫療財團法人嘉義基督教醫院",
    "長庚醫療財團法人嘉義長庚紀念醫院",
    "佛教慈濟醫療財團法人大林慈濟醫院",
    "國立成功大學醫學院附設醫院",
    "奇美醫療財團法人奇美醫院",
    "財團法人私立高雄醫學大學附設中和紀念醫院",
    "高雄榮民總醫院",
    "長庚醫療財團法人高雄長庚紀念醫院",
    "義大醫療財團法人義大醫院",
}

E_HOSPITALS = {
    "佛教慈濟醫療財團法人花蓮慈濟醫院",
}

O_HOSPITALS = {
    "診所",
    "其他",
}